0 min, 0 sec: Starting grid search job
0 min, 0 sec: Outputs being written to ['011920-214945-validation-auc-results.csv', '011920-214945-train-auc-results.csv']
0 min, 2 sec: Loaded data with shape (2800000, 201)
0 min, 2 sec: Starting cross-validation
0 min, 2 sec: Using config: layers:32+32-learn_rate:0.001-batch_size:128-dropout_rate:0.5-bathcnorm:True
0 min, 2 sec: Starting fold 0
0 min, 2 sec: Model Summary:
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 32)                6432      
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
activation_1 (Activation)    (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization_2 (Batch (None, 32)                128       
_________________________________________________________________
activation_2 (Activation)    (None, 32)                0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 33        
=================================================================
Total params: 7,777
Trainable params: 7,649
Non-trainable params: 128
_________________________________________________________________

0 min, 2 sec: Starting training...
