markup 64+64
Starting grid search job 0 min, 0 sec
Outputs being written to ['011920-074739-validation-auc-results.csv', '011920-074739-train-auc-results.csv']
Loaded data with shape (2800000, 201) 0 min, 6 sec
Starting cross-validation 0 min, 10 sec
Using config: layers:64+64-learn_rate:0.001-batch_size:128-dropout_rate:0.5-bathcnorm:True
Starting fold 0 0 min, 12 sec
Model summary
Model Summary:
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 64)                12864     
_________________________________________________________________
batch_normalization (BatchNo (None, 64)                256       
_________________________________________________________________
activation (Activation)      (None, 64)                0         
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                4160      
_________________________________________________________________
batch_normalization_1 (Batch (None, 64)                256       
_________________________________________________________________
activation_1 (Activation)    (None, 64)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 65        
=================================================================
Total params: 17,601
Trainable params: 17,345
Non-trainable params: 256
_________________________________________________________________

Starting training... 0 min, 17 sec
Trainin complete! 36 min, 2 sec
Starting fold 1 36 min, 2 sec
Starting training... 36 min, 14 sec
Trainin complete! 72 min, 45 sec
Starting fold 2 72 min, 45 sec
Starting training... 72 min, 55 sec
Trainin complete! 110 min, 30 sec
Job complete... 110 min, 30 sec
markup 32+32
Starting grid search job 0 min, 0 sec
Outputs being written to ['011920-074739-validation-auc-results.csv', '011920-074739-train-auc-results.csv']
Loaded data with shape (2800000, 201) 0 min, 6 sec
Starting cross-validation 0 min, 10 sec
Using config: layers:32+32-learn_rate:0.001-batch_size:128-dropout_rate:0.5-bathcnorm:True
Starting fold 0 0 min, 12 sec
Model summary
Model Summary:
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 32)                6432      
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
activation (Activation)      (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
activation_1 (Activation)    (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 33        
=================================================================
Total params: 7,777
Trainable params: 7,649
Non-trainable params: 128
_________________________________________________________________

Starting training... 0 min, 17 sec
Trainin complete! 36 min, 6 sec
Starting fold 1 36 min, 6 sec
Starting training... 36 min, 16 sec
Trainin complete! 72 min, 44 sec
Starting fold 2 72 min, 44 sec
Starting training... 72 min, 54 sec
Trainin complete! 110 min, 37 sec
Job complete... 110 min, 37 sec
markup 128+64+32
Starting grid search job 0 min, 0 sec
Outputs being written to ['011920-074739-validation-auc-results.csv', '011920-074739-train-auc-results.csv']
Loaded data with shape (2800000, 201) 0 min, 6 sec
Starting cross-validation 0 min, 10 sec
Using config: layers:128+64+32-learn_rate:0.001-batch_size:128-dropout_rate:0.5-bathcnorm:True
Starting fold 0 0 min, 11 sec
Model summary
Model Summary:
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 128)               25728     
_________________________________________________________________
batch_normalization (BatchNo (None, 128)               512       
_________________________________________________________________
activation (Activation)      (None, 128)               0         
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
batch_normalization_1 (Batch (None, 64)                256       
_________________________________________________________________
activation_1 (Activation)    (None, 64)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
batch_normalization_2 (Batch (None, 32)                128       
_________________________________________________________________
activation_2 (Activation)    (None, 32)                0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 33        
=================================================================
Total params: 36,993
Trainable params: 36,545
Non-trainable params: 448
_________________________________________________________________

Starting training... 0 min, 17 sec
Trainin complete! 40 min, 58 sec
Starting fold 1 40 min, 58 sec
Starting training... 41 min, 6 sec
Trainin complete! 80 min, 55 sec
Starting fold 2 80 min, 55 sec
Starting training... 81 min, 7 sec
Trainin complete! 114 min, 53 sec
Job complete... 114 min, 53 sec
