0 min, 0 sec: Starting grid search job
0 min, 0 sec: Outputs being written to ['012020-145131-validation-auc-results.csv', '012020-145131-train-auc-results.csv']
0 min, 6 sec: Loaded data with shape (2800000, 201)
0 min, 10 sec: Starting cross-validation
0 min, 10 sec: Using config: layers:32+32+32-learn_rate:0.001-batch_size:128-dropout_rate:0.5-bathcnorm:True
0 min, 11 sec: Starting fold 0
0 min, 15 sec: Model Summary:
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 32)                6432      
_________________________________________________________________
batch_normalization (BatchNo (None, 32)                128       
_________________________________________________________________
activation (Activation)      (None, 32)                0         
_________________________________________________________________
dropout (Dropout)            (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
activation_1 (Activation)    (None, 32)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization_2 (Batch (None, 32)                128       
_________________________________________________________________
activation_2 (Activation)    (None, 32)                0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 33        
=================================================================
Total params: 8,961
Trainable params: 8,769
Non-trainable params: 192
_________________________________________________________________

0 min, 15 sec: Starting training...
6 min, 11 sec: Epoch: 0  val_auc: 0.7852804472193013
14 min, 52 sec: Epoch: 1  val_auc: 0.7912519585290895
22 min, 53 sec: Epoch: 2  val_auc: 0.7950802459002756
29 min, 53 sec: Epoch: 3  val_auc: 0.7966634832452295
36 min, 4 sec: Epoch: 4  val_auc: 0.7985406371312833
42 min, 17 sec: Epoch: 5  val_auc: 0.7992699246969037
49 min, 15 sec: Epoch: 6  val_auc: 0.7993993430149047
